import re

def find_w(text):
    # Регулярное выражение для поиска слов с двумя подряд стоящими гласными и следующими словами с не более 3 согласными
    pattern = r'\w*[аеёиоуыэюя]{2}\w*(?!\s+(?:[аеёиоуыэюя]*[бвгджзйклмнпрстфхцчшщь]){4,})\b'
    
    # Находим все соответствия в тексте
    matches = re.findall(pattern, text, flags=re.IGNORECASE)
    
    return matches

t1 = "Кривошеее существо гуляет по парку"
t2 = 'Заблестело море тихо рядом собака ждала'
t3 = 'Орлиные крылья веяли над озером, птицы быстро летели'
t4 = 'На вершине горы стояли высокие деревья и ветер холодный'
t5 = 'Улыбается небо ярко и птицы поют весело'

print(find_w(t1))
print(find_w(t2))
print(find_w(t3))
print(find_w(t4))
print(find_w(t5))
